# POSTEST 4 
### NAMA : AGDITHA EVALYN LOLONGAN
### NIM : 2109106030

### Dataset memiliki nilai null

### import  library

In [2]:
import pandas as pd
import numpy as np 
from sklearn.model_selection import train_test_split

In [3]:
dataset_split = pd.read_csv("tested.csv")

In [4]:
dataset_split.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.0,0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S
5,897,0,3,"Svensson, Mr. Johan Cervin",male,14.0,0,0,7538,9.2250,NaN,S
6,898,1,3,"Connolly, Miss. Kate",female,30.0,0,0,330972,7.6292,NaN,Q
7,899,0,2,"Caldwell, Mr. Albert Francis",male,26.0,1,1,248738,29.0000,NaN,S
8,900,1,3,"Abrahim, Mrs. Joseph (Sophie Halaut Easu)",female,18.0,0,0,2657,7.2292,NaN,C
9,901,0,3,"Davies, Mr. John Samuel",male,21.0,2,0,A/4 48871,24.1500,NaN,S

### MENGECEK PADA ATTRIBUT APAKAH ADA NULL

In [5]:
dataset_split.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

In [6]:
dataset_split.shape

(418, 12)

## membagi training set dan testing set dengan ketentuan 70:30

In [7]:
X = dataset_split.iloc[:,:-1]
y = dataset_split.iloc[:,-1]

X_train, X_test, y_train, y_test = train_test_split(X, y, test_size = 0.3)

In [8]:
print("Dataset dibagi dengan proporsi 70:30\n")
print("Dimensi X_train: ", X_train.shape)
print("Dimensi X_test: ", X_test.shape)
print("Dimensi y_train: ", y_train.shape)
print("Dimensi y_test: ", y_test.shape)

Dataset dibagi dengan proporsi 70:30

Dimensi X_train:  (292, 11)
Dimensi X_test:  (126, 11)
Dimensi y_train:  (292,)
Dimensi y_test:  (126,)

# Mengatasi Nilai null

### tested1 adalah dataset yang dirusak

In [9]:
df=pd.read_csv("tested1.csv")

## mengganti nilai null

#### mean untuk data bertipe float

In [10]:
from sklearn.impute import SimpleImputer
imputer = SimpleImputer(strategy="mean")

In [11]:
df["Age"]=imputer.fit_transform(df[["Age"]])

In [12]:
df.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.0,0,0,330911,7.8292,NaN,Q
1,892,0,3,"Kelly, Mr. James",male,34.0,0,0,330911,7.8292,NaN,Q
2,892,0,3,"Kelly, Mr. James",male,34.0,0,0,330911,7.8292,NaN,Q
3,892,0,3,"Kelly, Mr. James",male,34.0,0,0,330911,7.8292,NaN,Q
4,892,0,3,"Kelly, Mr. James",male,34.0,0,0,330911,7.8292,NaN,Q
5,892,0,3,"Kelly, Mr. James",male,34.0,0,0,330911,7.8292,NaN,Q
6,892,0,3,"Kelly, Mr. James",male,34.0,0,0,330911,7.8292,NaN,Q
7,892,0,3,"Kelly, Mr. James",male,34.0,0,0,330911,7.8292,NaN,Q
8,900,1,3,"Abrahim, Mrs. Joseph (Sophie Halaut Easu)",female,18.0,0,0,2657,7.2292,NaN,C
9,901,0,3,"Davies, Mr. John Samuel",male,21.0,2,0,A/4 48871,24.1500,NaN,S

## setelah dibersihkan

In [13]:
df.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

## membersihkan attribut yang lain yang memiliki null

In [14]:
from sklearn.impute import SimpleImputer
imputer = SimpleImputer(strategy="mean")

In [15]:
df["Fare"]=imputer.fit_transform(df[["Fare"]])

In [16]:
from sklearn.impute import SimpleImputer
imputer = SimpleImputer(strategy="most_frequent")

In [17]:
df["Cabin"]=imputer.fit_transform(df[["Cabin"]])

## setelah dibersihkan

In [18]:
df.isna().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          0
Embarked       0
dtype: int64

## MENGATASI NILAI DUPLICATE

### dataset diatas memiliki dataset yang sama (duplicate)

In [19]:
df=pd.read_csv("tested1.csv")

In [20]:
df[df.duplicated()]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,892,0,3,"Kelly, Mr. James",male,34.0,0,0,330911,7.8292,NaN,Q
2,892,0,3,"Kelly, Mr. James",male,34.0,0,0,330911,7.8292,NaN,Q
3,892,0,3,"Kelly, Mr. James",male,34.0,0,0,330911,7.8292,NaN,Q
4,892,0,3,"Kelly, Mr. James",male,34.0,0,0,330911,7.8292,NaN,Q
5,892,0,3,"Kelly, Mr. James",male,34.0,0,0,330911,7.8292,NaN,Q
6,892,0,3,"Kelly, Mr. James",male,34.0,0,0,330911,7.8292,NaN,Q
7,892,0,3,"Kelly, Mr. James",male,34.0,0,0,330911,7.8292,NaN,Q

In [21]:
df.drop_duplicates(inplace=True)

In [22]:
df[df.duplicated()]

Empty DataFrame
Columns: [PassengerId, Survived, Pclass, Name, Sex, Age, SibSp, Parch, Ticket, Fare, Cabin, Embarked]
Index: []

## Melakukan Normalisasi pada data

In [23]:
from sklearn.preprocessing import MinMaxScaler

In [24]:
min_max_scaler = MinMaxScaler()

In [25]:
x_scaled = min_max_scaler.fit_transform(
    df[['Fare']]
)

In [26]:
data_normalization = pd.DataFrame(x_scaled)
data_normalization.head()

          0
0  0.015282
1  0.014110
2  0.047138
3  0.015412
4  0.050749

## Melakukan Standarisasi pada  data

In [51]:
from sklearn.impute import SimpleImputer
imputer = SimpleImputer(strategy="mean")

In [52]:
df["Fare"]=imputer.fit_transform(df[["Fare"]])

In [53]:
imputer = SimpleImputer(strategy="most_frequent")

In [54]:
df["Cabin"]=imputer.fit_transform(df[["Cabin"]])

In [55]:
imputer = SimpleImputer(strategy="mean")

In [56]:
df["Age"]=imputer.fit_transform(df[["Age"]])

In [67]:
np.std(df)

PassengerId    120.780146
Survived         0.478953
Pclass           0.842149
Age             12.519052
SibSp            0.895236
Parch            0.979717
Fare            55.797639
dtype: float64

In [66]:
from sklearn.preprocessing import StandardScaler
ss = StandardScaler()

In [59]:
x_scaled2 = ss.fit_transform(
     df[['PassengerId', 'Survived', 'Pclass', 'Age','SibSp', 'Parch','Fare']]
)

In [60]:
data_standarization = pd.DataFrame(x_scaled2)
data_standarization.head()

          0         1         2         3         4         5        6
0 -1.725722 -0.744247  0.866432  0.299784 -0.491704 -0.395583 -0.49696
1 -1.725722 -0.744247  0.866432  0.299784 -0.491704 -0.395583 -0.49696
2 -1.725722 -0.744247  0.866432  0.299784 -0.491704 -0.395583 -0.49696
3 -1.725722 -0.744247  0.866432  0.299784 -0.491704 -0.395583 -0.49696
4 -1.725722 -0.744247  0.866432  0.299784 -0.491704 -0.395583 -0.49696

In [61]:
df.isna().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          0
Embarked       0
dtype: int64

In [62]:
np.std(x_scaled2)

1.0

In [63]:
np.mean(x_scaled2)

1.171691285045278e-16

In [64]:
dataset_split.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Survived     418 non-null    int64
 2   Pclass       418 non-null    int64
 3   Name         418 non-null    object
 4   Sex          418 non-null    object
 5   Age          332 non-null    float64
 6   SibSp        418 non-null    int64
 7   Parch        418 non-null    int64
 8   Ticket       418 non-null    object
 9   Fare         417 non-null    float64
 10  Cabin        91 non-null     object
 11  Embarked     418 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 39.3+ KB

## MENGUBAH SALAH SATU TYPE DATA

#### MERUBAH TYPE DATA AGE YANG BERTIPE FLOAT MENJADI OBJECT

In [69]:
dfubah = df[["Age"]].astype("object")
print("tipe data setelah di ubah") 
dfubah["Age"].dtypes

tipe data setelah di ubah

dtype('O')

## one-hot encoding

In [70]:
df = pd.read_csv("tested1.csv")

In [71]:
from sklearn.preprocessing import OneHotEncoder

In [72]:
onehotencoder = OneHotEncoder(sparse=False)

### SEX (category)

In [73]:
onehot = onehotencoder.fit_transform(df[['Sex']])

In [74]:
dfonehot= pd.DataFrame(onehot)

In [75]:
dfonehot.head(10)

     0    1
0  0.0  1.0
1  0.0  1.0
2  0.0  1.0
3  0.0  1.0
4  0.0  1.0
5  0.0  1.0
6  0.0  1.0
7  0.0  1.0
8  1.0  0.0
9  0.0  1.0